from main_model import load_model, segment_with_model

model, char_to_idx, idx_to_char = load_model("kannada_segmentation_m_json.pth")
test_input = "ಅಷ್ಟಮಹಾಪ್ರಾತಿಹಾರ್ಯವಯ್ಭವದಿದಅಷ್ಟಗುಣನ್ಗಳೋಳೋಮ್ದಮ್ಸ್ರ್ಷ್ಟಿನ್ಮನ್ಗಳಪರ್ಯಾಯದಿನಿತಅಷ್ಟಮ್ಗೆನಗೆರಗುವೆನುಟಣೆಯಕೋಲುಪುಅಜಿಅಪಿನ್ಛಪಾತ್ರೆಯಅವತ್ರದಾಕಸ್ತಕ್ಲದನವಕಾರಮಂತ್ರಸಿದಿಮನ್ಡಣವೆಂದುಭುವಲಯದೊಳುಪೇಗೆಕಾರಮಾಟವಣೆಯೊಳಕ್ಷರದನ್ಳ್ದಮಹಿಇಸಿದವಯವವದೆಮ್ಹಾವ್ಕವಸ್ಥಾಪ್ವರಿಗೆತಕಶಕ್ತಿಗೆವ್ರ್ತೌಅವರಮನ್ಗಲದಭುವಲಯಅರ್ವಾದನವಆರದತಿಶಯವಿಹನ್ವಿಹವಾಣಿಓಮ್ಕಾಣಿಎಂದೆನುವಮಹಿಇನಮಹಾವೀರವ್ಭ್ರುತವೆನುವಮಹ್ಮೆಯಮ್ನ್ಗಲಪ್ರಾಲಯಹಕೌದ್ವಿಸಸಿಧಕಾವ್ಯಭೂವತೆನ್ಟುಪ್ರಕಟಅಮ್ಯೋಗದೊಳಗೆಇಪಅಕಲಾನ್ಕದೋಳ್ದೊಳರವತಮ್ಕುಡೆಸ್ಸಕಲಾಗಮಬಿಟಸೊನೆಯೆಎನ್ಟೆನ್ಟುಳುಮುಂದಕೆಏಳುಭನ್ಗಕಮಲಗಳೇಅಗೆರಡುಕ್ಪೋಗುತಿರ್ದಾಗಕ್ರಮದೊಳೊನೆಯುಆರಾಲ್ನೂರುತಮಲಾನ್ಕಐದುಸ್ಭೂವಲೌಎರ್ಡಯ್ದುಕಮಲದಗಂಧಗಳ್ಚಯಮ್ಮಹ್ರುದಯದೊಳಾಕಮಲಅವದ್ಲಿಪಾಗವಿಮಲಾನ್ಕಗೆಲುವಂದೊನೆಉಸಮವನುಬೆಸದೊಳುಭಾಗಿಸೆಸಿಭ್ಯಕ್ರಮವಿಹಕಾವ್ಯ್ಭೂವ್ಲಯಸಿರು"
words = segment_with_model(test_input, model, char_to_idx)
print("Segmented Words:")
for i in range(len(words)):
    print(f"{i+1}. {words[i]}")
